app/views/users/show.html.erb


<% if @user.likes.exists? %>
---
SELECT  1 AS one FROM "likes" WHERE "likes"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 2]]